IDEA StatiCa Open Model
ConcreteCheckResultBase.Check Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 settings of check type
 Namespace: IdeaRS.OpenModel.Concrete.CheckResult
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public CalculationType Check { get; set; }
Public Property Check As CalculationType
	Get
	Set
public:
property CalculationType Check {
	CalculationType get ();
	void set (CalculationType value);
}
Property Value
Type: CalculationType
See Also
Reference
ConcreteCheckResultBase Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace